scalarTransport/windowsOpenBus-case/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.26;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
    }
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    1;//0.07*D_hy
        value           $internalField;
    }
    ground
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    1;
        value           $internalField;
    }
    star
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    port
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    top
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    interior
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    exterior
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    seats
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    exhaust
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.05;
        value           $internalField;
    }
    rails
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    vents
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.005;
        value           $internalField;
    }
    driver
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    standingFwd
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    standingRear
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    mouthDriver
    {
        // type            inletOutlet;
        // inletValue      $internalField;
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.0075;
        value           $internalField;
    }
    mouthStandingRear
    {
        // type            inletOutlet;
        // inletValue      $internalField;
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.0075;
        value           $internalField;
    }
    mouthStandingFwd
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.0075;
        value           $internalField;
    }
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
